package com.example.qaztutor.models

import java.io.Serializable

class Chapter(
    var id: String = "",
    var title: String = "",
    var passed: Boolean = false,
    var content: String = "",
    var text: String = "\n" +
            "Фонетика - тіл білімінің дыбыстық жағын зерттейтін сала. Фонетика дыбыстардың жасалу, айтылу, естілу және буын, екпін, интонация мәселелерін қарастырады.\n" +
            "Қазақ әліпбиінде 42 әріп бар. Оның ішінде 9 әріп қазақ әріптері:  Ә, Ғ, Қ, Ң, Ө, Ұ, Ү, Һ, І\n" +
            "Әріп – дыбыстың жазылуы. \n" +
            "Дыбыстар дауысты және дауыссыз болып екіге бөлінеді. \n" +
            "Дауысты дыбыстар: а, ә, е, о, ө, ұ, ү, ы, і, и, э, у\n" +
            "Дауыссыз дыбыстар: б,в,г,ғ,д,ж,з,й,к,қ,л,м,н,ң,п,р,с,т,ф,х,һ,ц,ч,ш,щ, у\n" +
            "У әрпі дауысты да, дауыссыз да бола алады.\n" +
            "Ё, И, У, Ю, Я әріптері екі дыбыстан тұрады және Дифтоңдар деп аталады.\n" +
            "Ё = Й + О\n" +
            "Ю = Й + У\n" +
            "Я = Й + А\n" +
            "И = Ы + Й немесе І + Й\n" +
            "У = Ұ + У немесе Ү + У\n" +
            "Қазақ тілінде и, у жазылғанымен үстіде көрсетілгендей дербес дауыстылар емес! \n" +
            "\n" +
            "\n" +
            "\n" +
            "\n"
) : Serializable